# SQL Assignment

In [ ]:
import pandas as pd
import sqlite3
from IPython.display import display, HTML

In [ ]:
# Note that this is not the same db we have used in course videos, please download from this link
# https://drive.google.com/file/d/1O-1-L1DdNxEK6O6nG2jS31MbrMh-OnXM/view?usp=sharing

In [ ]:
from google.colab import drive
drive.mount('/content/drive/')

Drive already mounted at /content/drive/; to attempt to forcibly remount, call drive.mount("/content/drive/", force_remount=True).

In [ ]:
conn = sqlite3.connect("/content/drive/My Drive/Colab Notebooks/Assignment 15/Db-IMDB-Assignment.db")

#### Overview of all tables

In [ ]:
tables = pd.read_sql_query("SELECT NAME AS 'Table_Name' FROM sqlite_master WHERE type='table'",conn)
tables = tables["Table_Name"].values.tolist()

In [ ]:
for table in tables:
    query = "PRAGMA TABLE_INFO({})".format(table)
    schema = pd.read_sql_query(query,conn)
    print("Schema of",table)
    display(schema)
    print("-"*100)
    print("\n")

Schema of Movie

   cid       name     type  notnull dflt_value  pk
0    0      index  INTEGER        0       None   0
1    1        MID     TEXT        0       None   0
2    2      title     TEXT        0       None   0
3    3       year     TEXT        0       None   0
4    4     rating     REAL        0       None   0
5    5  num_votes  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Genre

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    GID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Language

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2   LAID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Country

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    CID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Location

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    LID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Location

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    LID     REAL        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Country

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    CID     REAL        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Language

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2   LAID  INTEGER        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Genre

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    GID  INTEGER        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Person

   cid    name     type  notnull dflt_value  pk
0    0   index  INTEGER        0       None   0
1    1     PID     TEXT        0       None   0
2    2    Name     TEXT        0       None   0
3    3  Gender     TEXT        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Producer

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Director

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Cast

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------

## Useful tips:

1. the year column in 'Movie' table, will have few chracters other than numbers which you need to be preprocessed, you need to get a substring of last 4 characters, its better if you convert it as int type, ex: CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER)

2. For almost all the TEXT columns we have show, please try to remove trailing spaces, you need to use TRIM() function

3. When you are doing count(coulmn) it won't consider the "NULL" values, you might need to explore other alternatives like Count(*)

## Q1 --- List all the directors who directed a 'Comedy' movie in a leap year. (You need to check that the genre is 'Comedy’ and year is a leap year) Your query should return director name, the movie name, and the year.

<h4>To determine whether a year is a leap year, follow these steps:</h4>

<ul>
    <li><b>STEP-1:</b> If the year is evenly divisible by 4, go to step 2. Otherwise, go to step 5.</li>
    <li><b>STEP-2:</b> If the year is evenly divisible by 100, go to step 3. Otherwise, go to step 4.</li>
    <li><b>STEP-3:</b> If the year is evenly divisible by 400, go to step 4. Otherwise, go to step 5.</li>
    <li><b>STEP-4:</b> The year is a leap year (it has 366 days).</li>
    <li><b>STEP-5:</b> The year is not a leap year (it has 365 days).</li>
</ul>

Year 1900 is divisible by 4 and 100 but it is not divisible by 400, so it is not a leap year.

In [ ]:
def run_query(q):
  result = pd.read_sql_query(q,conn)
  print(result.head(10))

In [ ]:
query= """ SELECT * FROM Movie """
run_query(query)

   index        MID                       title  year  rating  num_votes
0      0  tt2388771                      Mowgli  2018     6.6      21967
1      1  tt5164214               Ocean's Eight  2018     6.2     110861
2      2  tt1365519                 Tomb Raider  2018     6.4     142585
3      3  tt0848228                The Avengers  2012     8.1    1137529
4      4  tt8239946                     Tumbbad  2018     8.5       7483
5      5  tt7027278                   Kedarnath  2018     5.5       1970
6      6  tt3498820  Captain America: Civil War  2016     7.8     536641
7      7  tt8108198                   Andhadhun  2018     9.0      18160
8      8  tt3741834                        Lion  2016     8.1     170216
9      9  tt6747420                Rajma Chawal  2018     5.7        681

In [ ]:
%%time
q = """SELECT count(*)
       FROM Genre g 
       JOIN M_Genre mg 
       ON TRIM(g.GID) = TRIM(mg.GID) 
       JOIN Movie m 
       ON TRIM(mg.MID) = TRIM(m.MID) 
       JOIN M_Director md
       ON TRIM(m.MID) = TRIM(md.MID)
       JOIN Person p
       ON TRIM(md.PID) = p.PID
       WHERE TRIM(g.Name) LIKE "%Comedy%" 
       AND
       TRIM(m.year) = CASE WHEN (
                CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER)%4 = 0 
                AND CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER)%100 != 0
                OR CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER)%400 = 0 
                )
        THEN year
        end
        """
run_query(q)

   count(*)
0       232
CPU times: user 1min 6s, sys: 0 ns, total: 1min 6s
Wall time: 1min 6s

In [ ]:
%%time
def grader_1(q1):
    q1_results  = pd.read_sql_query(q1,conn)
    print(q1_results.head(10))
    assert (q1_results.shape == (232,3))

query1 = """SELECT m.title AS "Movie Name", m.year AS "Year", p.Name AS "Director Name"
       FROM Genre g 
       JOIN M_Genre mg 
       ON g.GID = TRIM(mg.GID) 
       JOIN Movie m 
       ON TRIM(mg.MID) = m.MID 
       JOIN M_Director md
       ON m.MID = TRIM(md.MID)
       JOIN Person p
       ON TRIM(md.PID) = p.PID
       WHERE TRIM(g.Name) LIKE "%Comedy%" 
       AND
       TRIM(m.year) = CASE WHEN (
                CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER)%4 = 0 
                AND CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER)%100 != 0
                OR CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER)%400 = 0 
                )
        THEN year
        end
        """
grader_1(query1)

                          Movie Name  Year      Director Name
0                         Mastizaade  2016       Milap Zaveri
1  Harold & Kumar Go to White Castle  2004       Danny Leiner
2                 Gangs of Wasseypur  2012     Anurag Kashyap
3        Around the World in 80 Days  2004       Frank Coraci
4             The Accidental Husband  2008      Griffin Dunne
5                             Barfi!  2012        Anurag Basu
6                  Bride & Prejudice  2004    Gurinder Chadha
7    Beavis and Butt-Head Do America  1996         Mike Judge
8                            Dostana  2008   Tarun Mansukhani
9                      Kapoor & Sons  2016       Shakun Batra
CPU times: user 10.2 s, sys: 2.9 ms, total: 10.3 s
Wall time: 10.3 s

## Q2 --- List the names of all the actors who played in the movie 'Anand' (1971)

In [ ]:
query= """ SELECT count(*) FROM Person WHERE TRIM(PID) IN (SELECT TRIM(PID) FROM M_Cast WHERE TRIM(MID) IN (SELECT TRIM(MID) FROM Movie WHERE TRIM(title) = "Anand"))
      """
run_query(query)

   count(*)
0        17

In [ ]:
%%time
def grader_2(q2):
    q2_results  = pd.read_sql_query(q2,conn)
    print(q2_results.head(10))
    assert (q2_results.shape == (17,1))


query2 = """ SELECT Name FROM Person WHERE TRIM(PID) IN (SELECT TRIM(PID) FROM M_Cast WHERE TRIM(MID) IN (SELECT TRIM(MID) FROM Movie WHERE TRIM(title) = "Anand")) """
grader_2(query2)

                Name
0   Amitabh Bachchan
1      Rajesh Khanna
2      Sumita Sanyal
3         Ramesh Deo
4          Seema Deo
5     Asit Kumar Sen
6         Dev Kishan
7       Atam Prakash
8      Lalita Kumari
9             Savita
CPU times: user 31.5 ms, sys: 0 ns, total: 31.5 ms
Wall time: 47.7 ms

## Q3 --- List all the actors who acted in a film before 1970 and in a film after 1990. (That is: < 1970 and > 1990.)

In [ ]:
%%time

def grader_3a(query_less_1970, query_more_1990):
    q3_a = pd.read_sql_query(query_less_1970,conn)
    q3_b = pd.read_sql_query(query_more_1990,conn)
    return (q3_a.shape == (4942,1)) and (q3_b.shape == (62570,1))

query_less_1970 =""" SELECT p.name FROM Person p WHERE p.PID IN 
                          (SELECT TRIM(mc.PID) FROM M_Cast mc WHERE TRIM(mc.MID) IN 
                          (SELECT TRIM(m.MID) FROM Movie m WHERE CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER) < 1970)) """
query_more_1990 =""" SELECT p.name FROM Person p WHERE p.PID IN 
                          (SELECT TRIM(mc.PID) FROM M_Cast mc WHERE TRIM(mc.MID) IN 
                          (SELECT TRIM(m.MID) FROM Movie m WHERE CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER) > 1990)) """
print(grader_3a(query_less_1970, query_more_1990))

# using the above two queries, you can find the answer to the given question

False
CPU times: user 156 ms, sys: 4.84 ms, total: 161 ms
Wall time: 163 ms

In [ ]:
%%time

def grader_3(q3):
    q3_results  = pd.read_sql_query(q3,conn)
    print(q3_results.head(10))
    print(q3_results.shape)
    assert (q3_results.shape == (300,1))

query3 = """ SELECT p.name FROM Person p WHERE p.PID IN 
                    (SELECT TRIM(mc1.PID) FROM M_Cast mc1 WHERE TRIM(mc1.MID) IN 
                    (SELECT TRIM(m1.MID) FROM Movie m1 WHERE CAST(SUBSTR(TRIM(m1.year),-4) AS INTEGER) > 1990) 
                    AND p.PID IN (SELECT TRIM(mc2.PID) FROM M_Cast mc2 WHERE TRIM(mc2.MID) IN 
                    (SELECT TRIM(m2.MID) FROM Movie m2 WHERE CAST(SUBSTR(TRIM(m2.year),-4) AS INTEGER) < 1970))) """

grader_3(query3)

                Name
0       Rishi Kapoor
1   Amitabh Bachchan
2             Asrani
3       Zohra Sehgal
4    Parikshat Sahni
5      Rakesh Sharma
6        Sanjay Dutt
7          Ric Young
8              Yusuf
9     Suhasini Mulay
(300, 1)
CPU times: user 28min 2s, sys: 35.6 s, total: 28min 38s
Wall time: 28min 39s

## Q4 --- List all directors who directed 10 movies or more, in descending order of the number of movies they directed. Return the directors' names and the number of movies each of them directed.

In [ ]:
query= """ SELECT count(p.PID)
           FROM Person p 
           JOIN M_Director md 
           ON p.PID = TRIM(md.PID)
           JOIN Movie m
           ON TRIM(md.MID) = TRIM(m.MID)
           GROUP BY p.PID
           HAVING COUNT(m.MID)>=10"""
run_query(query)

   count(p.PID)
0            10
1            13
2            18
3            13
4            21
5            13
6            10
7            13
8            12
9            17

In [ ]:
%%time

def grader_4a(query_4a):
    query_4a = pd.read_sql_query(query_4a,conn)
    print(query_4a.head(10)) 
    return (query_4a.shape == (1462,2))

query_4a =""" *** Write a query, which will return all the directors(id's) along with the number of movies they directed *** """
print(grader_4a(query_4a))

# using the above query, you can write the answer to the given question

  Director_ID  Movie_Count
0   nm0000180            1
1   nm0000187            1
2   nm0000229            1
3   nm0000269            1
4   nm0000386            1
5   nm0000487            2
6   nm0000965            1
7   nm0001060            1
8   nm0001162            1
9   nm0001241            1
True
Wall time: 16 ms

In [ ]:
%%time
def grader_4(q4):
    q4_results  = pd.read_sql_query(q4,conn)
    print(q4_results.head(10))
    assert (q4_results.shape == (58,2))

query4 = """ SELECT p.PID Director_ID, COUNT(*) Movie_Count
           FROM Person p 
           JOIN M_Director md 
           ON p.PID = TRIM(md.PID)
           JOIN Movie m
           ON TRIM(md.MID) = TRIM(m.MID)
           GROUP BY p.PID
           HAVING COUNT(*)>=10
           ORDER BY COUNT(*) DESC """
grader_4(query4)

  Director_ID  Movie_Count
0   nm0223522           39
1   nm0080315           35
2   nm0698184           30
3   nm0890060           30
4   nm0080333           29
5   nm0611531           27
6   nm0007181           21
7   nm0154113           19
8   nm0759662           19
9   nm0007131           18
CPU times: user 1.88 s, sys: 0 ns, total: 1.88 s
Wall time: 1.88 s

## Q5.a --- For each year, count the number of movies in that year that had only female actors.

In [ ]:
query= """ SELECT m.year, count(m.MID)
            FROM Movie m
            WHERE NOT EXISTS
            (SELECT * 
              FROM M_Cast mc, Person p
              WHERE p.gender ="Male" AND mc.MID = m.MID AND mc.PID = p.PID)
            GROUP BY m.year """
run_query(query)

   year  count(m.MID)
0  1931             1
1  1936             3
2  1939             2
3  1941             1
4  1943             1
5  1946             2
6  1947             2
7  1948             3
8  1949             3
9  1950             2

In [ ]:
%%time

# note that you don't need TRIM for person table

def grader_5aa(query_5aa):
    query_5aa = pd.read_sql_query(query_5aa,conn)
    print(query_5aa.head(10)) 
    return (query_5aa.shape == (8846,3))

query_5aa =""" SELECT m.MID, p.Gender, count(p.Gender)
    FROM Movie m 
    JOIN M_Cast mc ON TRIM(m.MID) = TRIM(mc.MID)
    JOIN Person p ON TRIM(mc.PID) = p.PID 
    GROUP BY TRIM(m.MID), p.Gender
    """

print(grader_5aa(query_5aa))

def grader_5ab(query_5ab):
    query_5ab = pd.read_sql_query(query_5ab,conn)
    print(query_5ab.head(10)) 
    return (query_5ab.shape == (3469, 3))

query_5ab ="""
SELECT m.MID, p.Gender, count(*)
    FROM Movie m 
    JOIN M_Cast mc ON TRIM(m.MID) = TRIM(mc.MID)
    JOIN Person p ON TRIM(mc.PID) = p.PID 
    WHERE p.Gender = "Male"
    GROUP BY m.MID, p.Gender
    HAVING count(*) >= 1
    """
print(grader_5ab(query_5ab))


# using the above queries, you can write the answer to the given question

         MID  Gender  count(p.Gender)
0  tt0021594    None                0
1  tt0021594  Female                3
2  tt0021594    Male                5
3  tt0026274    None                0
4  tt0026274  Female               11
5  tt0026274    Male                9
6  tt0027256    None                0
7  tt0027256  Female                5
8  tt0027256    Male                8
9  tt0028217  Female                3
True
         MID Gender  count(*)
0  tt0021594   Male         5
1  tt0026274   Male         9
2  tt0027256   Male         8
3  tt0028217   Male         7
4  tt0031580   Male        27
5  tt0033616   Male        46
6  tt0036077   Male        11
7  tt0038491   Male         7
8  tt0039654   Male         6
9  tt0040067   Male        10
True
CPU times: user 1min 34s, sys: 6.84 s, total: 1min 40s
Wall time: 1min 40s

In [ ]:
%%time
def grader_5a(q5a):
    q5a_results  = pd.read_sql_query(q5a,conn)
    print(q5a_results.head(10))
    assert (q5a_results.shape == (4,2))

query5a = """ SELECT CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER), count(m.MID) Movie_Count
            FROM Movie m
            WHERE NOT EXISTS
            (SELECT * 
              FROM M_Cast mc, Person p
              WHERE TRIM(p.gender) ="Male" AND TRIM(mc.MID) = TRIM(m.MID) AND TRIM(mc.PID) = TRIM(p.PID))
            GROUP BY CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER) """
grader_5a(query5a)

   CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER)  Movie_Count
0                                      1939            1
1                                      1999            1
2                                      2000            1
3                                      2018            1
CPU times: user 38.8 s, sys: 2 s, total: 40.8 s
Wall time: 40.8 s

## Q5.b --- Now include a small change: report for each year the percentage of movies in that year with only female actors, and the total number of movies made that year. For example, one answer will be: 1990 31.81 13522 meaning that in 1990 there were 13,522 movies, and 31.81% had only female actors. You do not need to round your answer.

In [ ]:
#source: https://stackoverflow.com/questions/57743348/sql-query-imdb-data-to-count-the-total-movies-with-only-female-cast-per-year
%%time
def grader_5b(q5b):
    q5b_results  = pd.read_sql_query(q5b,conn)
    print(q5b_results.head(10))
    assert (q5b_results.shape == (4,3))

query5b = """ SELECT female_count.year Year,((female_count.Total_movies_with_only_female_leads)*100)/total_count.Total Percentage, total_count.Total FROM 
                            ((SELECT movie.year Year,count(*) Total_movies_with_only_female_leads FROM movie WHERE NOT EXISTS 
                            ( SELECT * FROM M_Cast,person WHERE TRIM(M_Cast.MID) = TRIM(movie.MID) and TRIM(M_Cast.PID) = TRIM(person.PID) AND person.gender='Male' ) 
                            GROUP BY movie.year) female_count, 
                            (SELECT movie.year,count(*) as Total FROM movie group by movie.year) total_count) 
                            WHERE female_count.year=total_count.year """
grader_5b(query5b)

     Year  Percentage  Total
0    1939          50      2
1    1999           1     66
2    2000           1     64
3  I 2018          10     10
CPU times: user 34.8 s, sys: 1.19 s, total: 36 s
Wall time: 36 s

## Q6 --- Find the film(s) with the largest cast. Return the movie title and the size of the cast. By "cast size" we mean the number of distinct actors that played in that movie: if an actor played multiple roles, or if it simply occurs multiple times in casts, we still count her/him only once.

In [ ]:
%%time
def grader_6(q6):
    q6_results  = pd.read_sql_query(q6,conn)
    print(q6_results.head(10))
    assert (q6_results.shape == (3473, 2))

query6 = """ SELECT m.title Movie_Name,count(distinct(c.PID)) Cast_Size FROM Movie m JOIN M_Cast c
                   ON c.MID = m.MID GROUP BY m.MID ORDER BY Cast_Size desc """
grader_6(query6)

                   Movie_Name  Cast_Size
0               Ocean's Eight        238
1                    Apaharan        233
2                        Gold        215
3             My Name Is Khan        213
4  Captain America: Civil War        191
5                    Geostorm        170
6                     Striker        165
7                        2012        154
8                      Pixels        144
9       Yamla Pagla Deewana 2        140
CPU times: user 191 ms, sys: 8.9 ms, total: 200 ms
Wall time: 201 ms

### Q7 --- A decade is a sequence of 10 consecutive years. 
### For example, say in your database you have movie information starting from 1931. 
### the first decade is 1931, 1932, ..., 1940,
### the second decade is 1932, 1933, ..., 1941 and so on. 
### Find the decade D with the largest number of films and the total number of films in D.

In [ ]:
%%time
def grader_7a(q7a):
    q7a_results  = pd.read_sql_query(q7a,conn)
    print(q7a_results.head(10))
    assert (q7a_results.shape == (78, 2))


query7a = """ SELECT Year, count(*) no_of_films FROM 
             (SELECT DISTINCT CAST(SUBSTR(TRIM(year),-4) AS INTEGER) Year from Movie) y 
             GROUP BY Year"""
grader_7a(query7a)

# using the above query, you can write the answer to the given question

   Year  no_of_films
0  1931            1
1  1936            1
2  1939            1
3  1941            1
4  1943            1
5  1946            1
6  1947            1
7  1948            1
8  1949            1
9  1950            1
CPU times: user 8.69 ms, sys: 1.9 ms, total: 10.6 ms
Wall time: 17.8 ms

In [ ]:
%%time
def grader_7b(q7b):
    q7b_results  = pd.read_sql_query(q7b,conn)
    print(q7b_results.head(10))
    assert (q7b_results.shape == (713, 4))

query7b = """   
    *** 
    Write a query that will do joining of the above table(7a) with itself 
    such that you will join with only rows if the second tables year is <= current_year+9 and more than or equal current_year
    *** 
          """
grader_7b(query7b)
# if you see the below results the first movie year is less than 2nd movie year and 
# 2nd movie year is less or equal to the first movie year+9

# using the above query, you can write the answer to the given question

   Movie_Year  Total_Movies  Movie_Year  Total_Movies
0        1931             1        1931             1
1        1931             1        1936             3
2        1931             1        1939             2
3        1936             3        1936             3
4        1936             3        1939             2
5        1936             3        1941             1
6        1936             3        1943             1
7        1939             2        1939             2
8        1939             2        1941             1
9        1939             2        1943             1
Wall time: 24 ms

In [ ]:
%%time
def grader_7(q7):
    q7_results  = pd.read_sql_query(q7,conn)
    print(q7_results.head(10))
    assert (q7_results.shape == (1, 2))

query7 = """ SELECT (Start||"-"||End) Decade, no_of_films from
             (SELECT y.year Start, y.year+9 End, count(*) no_of_films FROM 
             (SELECT DISTINCT year from Movie) y 
             JOIN Movie m ON CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER) >= Start and CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER)<= End 
             GROUP BY End ORDER BY no_of_films desc LIMIT 1) """
grader_7(query7)
# if you check the output we are printinng all the year in that decade, its fine you can print 2008 or 2008-2017

      Decade  no_of_films
0  2008-2017         1203
CPU times: user 164 ms, sys: 1.95 ms, total: 166 ms
Wall time: 168 ms

## Q8 --- Find all the actors that made more movies with Yash Chopra than any other director.

In [ ]:
%%time
def grader_8a(q8a):
    q8a_results  = pd.read_sql_query(q8a,conn)
    print(q8a_results.head(10))
    assert (q8a_results.shape == (73408, 3))

query8a = """ *** Write a query that will results in number of movies actor-director worked together ***"""
grader_8a(query8a)

# using the above query, you can write the answer to the given question

       actor   director  movies
0  nm0000002  nm0496746       1
1  nm0000027  nm0000180       1
2  nm0000039  nm0896533       1
3  nm0000042  nm0896533       1
4  nm0000047  nm0004292       1
5  nm0000073  nm0485943       1
6  nm0000076  nm0000229       1
7  nm0000092  nm0178997       1
8  nm0000093  nm0000269       1
9  nm0000096  nm0113819       1
Wall time: 534 ms

In [ ]:
#SOURCE: GITHUB
%%time

def grader_8(q8):
    q8_results  = pd.read_sql_query(q8,conn)
    print(q8_results.head(10))
    print(q8_results.shape)
    assert (q8_results.shape == (245, 2))

query8 = """    SELECT * FROM
                (SELECT DISTINCT t1.Director as d, t2.Actor a, Count(DISTINCT Trim(m.mid)) Movies_without_Yash FROM
                (SELECT p.PID Director, md.MID movie FROM Person p 
                JOIN M_Director md ON p.PID = TRIM(md.PID) AND p.Name NOT LIKE '%Yash Chpora%') t1
                    JOIN
                (SELECT p.PID Actor, mc.MID movie FROM Person p 
                JOIN M_Cast mc ON p.PID = TRIM(mc.PID)) t2
                ON TRIM(t1.movie) = TRIM(t2.movie) 
                GROUP BY t1.Director, t2.Actor) t3

                JOIN
                
                (SELECT DISTINCT t1.Director d, t2.Actor a, Count(DISTINCT Trim(m.mid)) Movies_with_yash FROM
                (SELECT p.PID Director, md.MID movie FROM Person p 
                JOIN M_Director md ON p.PID = TRIM(md.PID) AND p.Name LIKE '%Yash Chopra%') t1
                    JOIN
                (SELECT p.PID Actor, mc.MID movie FROM Person p 
                JOIN M_Cast mc ON p.PID = TRIM(mc.PID)) t2
                ON TRIM(t1.movie) = TRIM(t2.movie) 
                GROUP BY t1.Director, t2.Actor) t4

                ON TRIM(t3.a) = TRIM(t4.a) 
                WHERE Movies_without_Yash < Movies_with_yash
                """
query8= """
 SELECT * 
FROM   ( 
                SELECT   pc.NAME, 
                         Count(DISTINCT m.mid) count_movie 
                FROM     movie m 
                JOIN     m_cast mc 
                ON       m.mid = Trim(mc.mid) 
                JOIN     m_director md 
                ON       m.mid = md.mid
                JOIN     person pc 
                ON       Trim(mc.pid) = Trim(pc.pid) 
                JOIN     person pd 
                ON       md.pid= pd.pid where pd.NAME = 'Yash Chopra' GROUP BY pc.NAME) lst_yc
                JOIN 
                         ( 
                                  SELECT   pc.NAME, 
                                           count(m.mid) count_movie 
                                  FROM     movie m 
                                  JOIN     m_cast mc 
                                  ON       m.mid = trim(mc.mid ) 
                                  JOIN     m_director md 
                                  ON       m.mid = md.mid
                                  JOIN     person pc 
                                  ON       trim(mc.pid) = trim(pc.pid) 
                                  JOIN     person pd 
                                  ON       md.pid = pd.pid
                                  WHERE    pd.NAME != 'Yash Chopra' 
                                  GROUP BY pc.NAME) lst_wo 
                ON       lst_yc.NAME = lst_wo.NAME 
                WHERE    lst_yc.count_movie > lst_wo.count_movie"""
grader_8(query8)

Empty DataFrame
Columns: [NAME, count_movie, NAME, count_movie]
Index: []
(0, 4)

AssertionError: ignored

## Q9 --- The Shahrukh number of an actor is the length of the shortest path between the actor and Shahrukh Khan in the "co-acting" graph. That is, Shahrukh Khan has Shahrukh number 0; all actors who acted in the same film as Shahrukh have Shahrukh number 1; all actors who acted in the same film as some actor with Shahrukh number 1 have Shahrukh number 2, etc. Return all actors whose Shahrukh number is 2.

In [ ]:
%%time
def grader_9a(q9a):
    q9a_results  = pd.read_sql_query(q9a,conn)
    print(q9a_results.head(10))
    print(q9a_results.shape)
    assert (q9a_results.shape == (2382, 1))

query9a = """ *** Write a query that answers the 9th question ***"""
grader_9a(query9a)
# using the above query, you can write the answer to the given question

# selecting actors who acted with srk (S1)
# selecting all movies where S1 actors acted, this forms S2 movies list
# selecting all actors who acted in S2 movies, this gives us S2 actors along with S1 actors
# removing S1 actors from the combined list of S1 & S2 actors, so that we get only S2 actors

      S1_PID
0  nm0004418
1  nm1995953
2  nm2778261
3  nm0631373
4  nm0241935
5  nm0792116
6  nm1300111
7  nm0196375
8  nm1464837
9  nm2868019
(2382, 1)
Wall time: 178 ms

In [ ]:
%%time
def grader_9(q9):
    q9_results  = pd.read_sql_query(q9,conn)
    print(q9_results.head(10))
    print(q9_results.shape)
    assert (q9_results.shape == (25698, 1))

query9 = """ WITH 
    SHAHRUKH_0 AS
    (
        SELECT
            TRIM(P.PID) PID
        FROM
            Person P
        WHERE
            Trim(P.Name) like '%Shahrukh%'
    ),
    SHAHRUKH_1_MOVIES AS
    (
        SELECT
            DISTINCT
            TRIM(MC.MID) MID,
            S0.PID
        FROM
            M_Cast MC,
            SHAHRUKH_0 S0
        WHERE
            TRIM(MC.PID) = S0.PID
    ),
    SHAHRUKH_1_ACTORS AS
    (
        SELECT
            DISTINCT
            TRIM(MC.PID) PID
        FROM
            M_Cast MC,
            SHAHRUKH_1_MOVIES S1M
        WHERE
            TRIM(MC.MID) = S1M.MID AND
            TRIM(MC.PID) <> S1M.PID
    ),
    SHAHRUKH_2_MOVIES AS
    (
        SELECT
            DISTINCT
            TRIM(MC.MID) MID,
            S1A.PID
        FROM
            M_Cast MC,
            SHAHRUKH_1_ACTORS S1A
        WHERE
            TRIM(MC.PID) = S1A.PID
    )
    SELECT
        DISTINCT
        TRIM(MC.PID) PID,
        TRIM(P.Name) ACTOR_NAME
    FROM
        Person P,
        M_Cast MC,
        SHAHRUKH_2_MOVIES S2M
    WHERE
            TRIM(MC.PID) = TRIM(P.PID) AND
            TRIM(MC.MID) = S2M.MID AND
            TRIM(MC.PID) <> S2M.PID"""

grader_9(query9)

         PID             ACTOR_NAME
0  nm2951768           Freida Pinto
1  nm6467532  Caroline Christl Long
2  nm6071249          Rajeev Pahuja
3  nm3491108      Michelle Santiago
4  nm7509518         Jandre le Roux
5  nm5951787             Raj Awasti
6  nm5525290        Michael Chapman
7  nm8232648            James Heron
8  nm7247557              Alex Jaep
9  nm6631007        Marian Lorencik
(15911, 2)

AssertionError: ignored